Table of Contents
 Class CrossSectionComponentThermalData
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Cross-section component thermal data
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentThermalDataItem,CI.CrossSection")]
public class CrossSectionComponentThermalData
Inheritance
object
CrossSectionComponentThermalData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 ComponentIndex
Zero based index of component
public int ComponentIndex { get; set; }
Property Value
int
 MoistureContent
Moisture content
public double MoistureContent { get; set; }
Property Value
double
 ThermalConductivityLimit
Thermal conductivity limit
public ThermalConductivityLimit ThermalConductivityLimit { get; set; }
Property Value
ThermalConductivityLimit
 Edit this page